sorosaulong-ux/gd32-test-project/Start/startup_gd32a72xx_m7_0.s
                DCD     TIMER5_CH1_UP_IRQHandler          ; 231:TIMER5 channel 1 upate interrupt
                DCD     TIMER5_CH2_UP_IRQHandler          ; 232:TIMER5 channel 2 upate interrupt
                DCD     TIMER5_CH3_UP_IRQHandler          ; 233:TIMER5 channel 3 upate interrupt
                DCD     TIMER6_CH0_UP_IRQHandler          ; 234:TIMER6 channel 0 upate interrupt
                DCD     TIMER6_CH1_UP_IRQHandler          ; 235:TIMER6 channel 1 upate interrupt
                DCD     TIMER6_CH2_UP_IRQHandler          ; 236:TIMER6 channel 2 upate interrupt
                DCD     TIMER6_CH3_UP_IRQHandler          ; 237:TIMER6 channel 3 upate interrupt
                DCD     0                                 ; 238:Reserved
                DCD     0                                 ; 239:Reserved
                DCD     0                                 ; 240:Reserved
                DCD     0                                 ; 241:Reserved
                DCD     0                                 ; 242:Reserved
                DCD     0                                 ; 243:Reserved
                DCD     0                                 ; 244:Reserved
                DCD     0                                 ; 245:Reserved
                DCD     0                                 ; 246:Reserved
                DCD     0                                 ; 247:Reserved
                DCD     0                                 ; 248:Reserved
                DCD     0                                 ; 249:Reserved
                DCD     0                                 ; 250:Reserved
                DCD     0                                 ; 251:Reserved
                DCD     0                                 ; 252:Reserved
                DCD     0                                 ; 253:Reserved
                DCD     CAN6_ECCERR_IRQHandler            ; 254:CAN6 ECC error interrupt
                DCD     CAN7_ECCERR_IRQHandler            ; 255:CAN7 ECC error interrupt
__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY
;/* reset Handler */
Reset_Handler   PROC
                EXPORT  Reset_Handler                     [WEAK]
                IMPORT  |Image$$RW_IRAM1$$RW$$Base|

;                /* Enable SYSCFG clock to get DTCM and ITCM information */
                 LDR     R0, =0x49001018
                 LDR     R2, [R0]
                 ORR     R2, #0x01
                 STR     R2, [R0]

;                /* get the DTCM size */
                 LDR     R0, =0x40010254
                 LDR     R2, [R0]
                 LDR     R0, = 0xFF000000
                 AND     R2, R2, R0
                 LSR     R2, R2, #24
                 ADD     R2, #8
                 MOV     R1, #1
;                /* Calculates the DTCM byte size */
                 LSL     R1, R1, R2
;                /* Initialize the DTCM */
                 LDR     R0, =0x20000000
                 ADD     R1, R0, R1
                 MOV     R2, #0x0
DTCMSRAM_INIT    STRD    R2, R2, [ R0 ], #8
                 CMP     R0, R1
                 BNE     DTCMSRAM_INIT

;                /* get the ITCM size */
                 LDR     R0, =0x40010254
                 LDR     R2, [R0]
                 LDR     R0, = 0x00FF0000
                 AND     R2, R2, R0
                 LSR     R2, R2, #16
                 ADD     R2, #8
                 MOV     R1, #1
;                /* Calculates the ITCM byte size */
                 LSL     R1, R1, R2
;                /* Initialize the ITCM */
                 LDR     R0, =0x00000000
                 ADD     R1, R0, R1
                 MOV     R2, #0x0
ITCMSRAM_INIT    STRD    R2, R2, [ R0 ], #8
                 CMP     R0, R1
                 BNE     ITCMSRAM_INIT

;If the actual size of SRAM used exceeds 32K, users need to modify the size to be greater than or equal to the actual size in use.
                 LDR     R0, =|Image$$RW_IRAM1$$RW$$Base|
                 ADD     R1, R0, #0x8000       ;Default SRAM size 32K
                 LDR     R2, =0x0
SRAM_INIT        STRD    R2, R2, [ R0 ] , #8
                 CMP     R0, R1
                 BNE     SRAM_INIT

                 IMPORT  SystemInit
                 IMPORT  __main
                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

;/* dummy Exception Handlers */
NMI_Handler     PROC
                EXPORT  NMI_Handler                       [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler                 [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler                 [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler                  [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler                [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                       [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler                  [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler                    [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler                   [WEAK]
                B       .
                ENDP

Default_Handler PROC
;               /* external interrupts handler */
                EXPORT  WWDGT0_IRQHandler                   [WEAK]
                EXPORT  HVD_LVD_IRQHandler                  [WEAK]
                EXPORT  RTC_Alarm_IRQHandler                [WEAK]
                EXPORT  RTC_IRQHandler                      [WEAK]
                EXPORT  FMC_IRQHandler                      [WEAK]
                EXPORT  RCU_IRQHandler                      [WEAK]
                EXPORT  EXTI0_IRQHandler                    [WEAK]
                EXPORT  EXTI1_IRQHandler                    [WEAK]
                EXPORT  EXTI2_IRQHandler                    [WEAK]
                EXPORT  EXTI3_IRQHandler                    [WEAK]
                EXPORT  EXTI4_IRQHandler                    [WEAK]
                EXPORT  DMA0_Channel0_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel1_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel2_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel3_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel4_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel5_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel6_IRQHandler            [WEAK]
                EXPORT  ADC0_IRQHandler                     [WEAK]
                EXPORT  CAN0_Message_IRQHandler             [WEAK]
                EXPORT  CAN0_IRQHandler                     [WEAK]
                EXPORT  CPU_INT0_IRQHandler                 [WEAK]
                EXPORT  CPU_INT1_IRQHandler                 [WEAK]
                EXPORT  CPU_INT2_IRQHandler                 [WEAK]
                EXPORT  CPU_INT3_IRQHandler                 [WEAK]
                EXPORT  CAN0_WKUP_IRQHandler                [WEAK]
                EXPORT  TIMER0_BRK_UP_TRG_CMT_IRQHandler    [WEAK]
                EXPORT  TIMER2_IRQHandler                   [WEAK]
                EXPORT  TIMER1_IRQHandler                   [WEAK]
                EXPORT  TIMER19_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  JDC_IRQHandler                      [WEAK]
                EXPORT  I2C0_EV_IRQHandler                  [WEAK]
                EXPORT  I2C0_ER_IRQHandler                  [WEAK]
                EXPORT  I2C1_EV_IRQHandler                  [WEAK]
                EXPORT  I2C1_ER_IRQHandler                  [WEAK]
                EXPORT  SPI0_IRQHandler                     [WEAK]
                EXPORT  SPI1_IRQHandler                     [WEAK]
                EXPORT  USART0_IRQHandler                   [WEAK]
                EXPORT  USART1_IRQHandler                   [WEAK]
                EXPORT  USART2_IRQHandler                   [WEAK]
                EXPORT  EXTI10_15_IRQHandler                [WEAK]
                EXPORT  EXTI5_9_IRQHandler                  [WEAK]
                EXPORT  TAMPER_IRQHandler                   [WEAK]
                EXPORT  TIMER20_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  EXTI42_101_IRQHandler               [WEAK]
                EXPORT  TIMER7_BRK_UP_TRG_CMT_IRQHandler    [WEAK]
                EXPORT  PLL_LOL_DES_RESET_IRQHandler        [WEAK]
                EXPORT  DMAMUX_OVR_IRQHandler               [WEAK]
                EXPORT  FPU_WAB_IRQHandler                  [WEAK]
                EXPORT  CMP0_EXTI_IRQHandler                [WEAK]
                EXPORT  CMP1_EXTI_IRQHandler                [WEAK]
                EXPORT  FMU_INIT_IRQHandler                 [WEAK]
                EXPORT  ADC1_IRQHandler                     [WEAK]
                EXPORT  ADC2_IRQHandler                     [WEAK]
                EXPORT  DAC0_IRQHandler                     [WEAK]
                EXPORT  STCM_IRQHandler                     [WEAK]
                EXPORT  DMA1_Channel0_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel1_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel2_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel3_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel4_IRQHandler            [WEAK]
                EXPORT  WWDGT1_IRQHandler                   [WEAK]
                EXPORT  CAN1_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN1_Message_IRQHandler             [WEAK]
                EXPORT  CAN1_IRQHandler                     [WEAK]
                EXPORT  CTI0_IRQHandler                     [WEAK]
                EXPORT  CTI1_IRQHandler                     [WEAK]
                EXPORT  CAN0_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN1_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN2_ECCERR_IRQHandler              [WEAK]
                EXPORT  MFCOM_IRQHandler                    [WEAK]
                EXPORT  CMP0_IRQHandler                     [WEAK]
                EXPORT  CMP1_IRQHandler                     [WEAK]
                EXPORT  SENT_IRQHandler                     [WEAK]
                EXPORT  HWSEM_IRQHandler                    [WEAK]
                EXPORT  CAN3_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN4_ECCERR_IRQHandler              [WEAK]
                EXPORT  DAC1_IRQHandler                     [WEAK]
                EXPORT  HSM_COM0_IRQHandler                 [WEAK]
                EXPORT  HSM_COM1_IRQHandler                 [WEAK]
                EXPORT  FMU_CAT_IRQHandler                  [WEAK]
                EXPORT  RCTL_IRQHandler                     [WEAK]
                EXPORT  IOC_IRQHandler                      [WEAK]
                EXPORT  SPI2_IRQHandler                     [WEAK]
                EXPORT  SPI3_IRQHandler                     [WEAK]
                EXPORT  SPI4_IRQHandler                     [WEAK]
                EXPORT  SPI5_IRQHandler                     [WEAK]
                EXPORT  SPI6_IRQHandler                     [WEAK]
                EXPORT  SPI7_IRQHandler                     [WEAK]
                EXPORT  QSPI_IRQHandler                     [WEAK]
                EXPORT  USART3_IRQHandler                   [WEAK]
                EXPORT  USART4_IRQHandler                   [WEAK]
                EXPORT  USART5_IRQHandler                   [WEAK]
                EXPORT  CAN2_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN3_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN4_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN5_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN6_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN7_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN2_Message_IRQHandler             [WEAK]
                EXPORT  CAN2_IRQHandler                     [WEAK]
                EXPORT  CAN3_Message_IRQHandler             [WEAK]
                EXPORT  CAN3_IRQHandler                     [WEAK]
                EXPORT  CAN4_Message_IRQHandler             [WEAK]
                EXPORT  CAN4_IRQHandler                     [WEAK]
                EXPORT  CAN5_Message_IRQHandler             [WEAK]
                EXPORT  CAN5_IRQHandler                     [WEAK]
                EXPORT  CAN6_Message_IRQHandler             [WEAK]
                EXPORT  CAN6_IRQHandler                     [WEAK]
                EXPORT  CAN7_Message_IRQHandler             [WEAK]
                EXPORT  CAN7_IRQHandler                     [WEAK]
                EXPORT  TIMER19_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER19_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER19_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER19_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  DMA0_Channel7_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel8_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel9_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel10_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel11_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel12_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel13_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel14_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel15_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel5_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel6_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel7_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel8_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel9_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel10_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel11_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel12_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel13_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel14_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel15_IRQHandler           [WEAK]
                EXPORT  MCMUA_RX_IRQHandler                 [WEAK]
                EXPORT  MCMUA_TX_IRQHandler                 [WEAK]
                EXPORT  MCMUA_NORMAL_IRQHandler            [WEAK]
                EXPORT  MCMUB_RX_IRQHandler                 [WEAK]
                EXPORT  MCMUB_TX_IRQHandler                 [WEAK]
                EXPORT  MCMUB_NORMAL_IRQHandler             [WEAK]
                EXPORT  LIN0_IRQHandler                     [WEAK]
                EXPORT  LIN1_IRQHandler                     [WEAK]
                EXPORT  LIN2_IRQHandler                     [WEAK]
                EXPORT  LIN3_IRQHandler                     [WEAK]
                EXPORT  LIN4_IRQHandler                     [WEAK]
                EXPORT  LIN5_IRQHandler                     [WEAK]
                EXPORT  LIN6_IRQHandler                     [WEAK]
                EXPORT  LIN7_IRQHandler                     [WEAK]
                EXPORT  LIN8_IRQHandler                     [WEAK]
                EXPORT  LIN9_IRQHandler                     [WEAK]
                EXPORT  LIN10_IRQHandler                    [WEAK]
                EXPORT  LIN11_IRQHandler                    [WEAK]
                EXPORT  TIMER0_CC0_CC0N_IRQHandler          [WEAK]
                EXPORT  TIMER0_CC1_CC1N_IRQHandler          [WEAK]
                EXPORT  TIMER0_CC2_CC2N_IRQHandler          [WEAK]
                EXPORT  TIMER0_CC3_CC3N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC0_CC0N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC1_CC1N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC2_CC2N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC3_CC3N_IRQHandler          [WEAK]
                EXPORT  TIMER1_CC0_IRQHandler               [WEAK]
                EXPORT  TIMER1_CC1_IRQHandler               [WEAK]
                EXPORT  TIMER1_CC2_IRQHandler               [WEAK]
                EXPORT  TIMER1_CC3_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC0_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC1_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC2_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC3_IRQHandler               [WEAK]
                EXPORT  FWDGT_IRQHandler                    [WEAK]
                EXPORT  ETH_IRQHandler                      [WEAK]
                EXPORT  ETH_WKUP_IRQHandler                 [WEAK]
                EXPORT  ETH_TX_IRQHandler                   [WEAK]
                EXPORT  ETH_RX_IRQHandler                   [WEAK]
                EXPORT  ETH_SAFETY_IRQHandler               [WEAK]
                EXPORT  RCU_CK_FAIL_IRQHandler              [WEAK]
                EXPORT  CAN5_ECCERR_IRQHandler              [WEAK]
                EXPORT  TIMER60_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER61_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER62_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER63_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER5_CH0_UP_IRQHandler            [WEAK]
                EXPORT  TIMER5_CH1_UP_IRQHandler            [WEAK]
                EXPORT  TIMER5_CH2_UP_IRQHandler            [WEAK]
                EXPORT  TIMER5_CH3_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH0_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH1_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH2_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH3_UP_IRQHandler            [WEAK]
                EXPORT  CAN6_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN7_ECCERR_IRQHandler              [WEAK]

